In [9]:
import pandas as pd

In [3]:
data = pd.DataFrame[
    {"ID": "A001", "Project": "Project 1", "Cost": 1002000, "Status": "Finished"},
    {"ID": "A002", "Project": "Project 2", "Cost": 2000000, "Status": "Ongoing"},
    {"ID": "A003", "Project": "Project 3", "Cost": 4500000, "Status": "Finished"},
    {"ID": "A004", "Project": "Project 4", "Cost": 5500000, "Status": "Ongoing"},
    {"ID": "A005", "Project": "Project 5", "Cost": None, "Status": "Finished"},
    {"ID": "A002", "Project": "Project 6", "Cost": 680000, "Status": "Failed"},
    {"ID": "A005", "Project": "Project 7", "Cost": 400000, "Status": "Finished"},
    {"ID": "A003", "Project": "Project 8", "Cost": 350000, "Status": "Failed"},
    {"ID": "A001", "Project": "Project 9", "Cost": None, "Status": "Ongoing"},
    {"ID": "A003", "Project": "Project 10", "Cost": 300000, "Status": "Finished"},
    {"ID": "A001", "Project": "Project 11", "Cost": 2000000, "Status": "Failed"},
    {"ID": "A004", "Project": "Project 12", "Cost": 1000000, "Status": "Ongoing"},
    {"ID": "A004", "Project": "Project 13", "Cost": 3000000, "Status": "Finished"},
    {"ID": "A005", "Project": "Project 14", "Cost": 200000, "Status": "Finished"},
]

In [13]:
df = pd.DataFrame(data)

In [15]:
df.to_csv("One_data.csv", index=False)

In [17]:
seniority_data = [
    {"ID": "A001", "Designation Level": 2},
    {"ID": "A002", "Designation Level": 2},
    {"ID": "A003", "Designation Level": 3},
    {"ID": "A004", "Designation Level": 2},
    {"ID": "A005", "Designation Level": 3},
]

In [18]:
seniority_df = pd.DataFrame(seniority_data)

In [19]:
seniority_df.to_csv("Two_data.csv", index=False)

In [20]:
employee_data = [
    {"ID": "A001", "Name": "John Alter", "Gender": "M", "City": "Paris", "Age": 25},
    {"ID": "A002", "Name": "Alice Luxumberg", "Gender": "F", "City": "London", "Age": 27},
    {"ID": "A003", "Name": "Tom Sabestine", "Gender": "M", "City": "Berlin", "Age": 29},
    {"ID": "A004", "Name": "Nina Adgra", "Gender": "F", "City": "Newyork", "Age": 31},
    {"ID": "A005", "Name": "Amy Johny", "Gender": "F", "City": "Madrid", "Age": 30},
]

In [21]:
employee_df = pd.DataFrame(employee_data)

In [22]:
employee_df.to_csv("three_data.csv", index=False)

In [ ]:
Task 2:-The cost column in the dataframe “Project” has some missing values. Your task is to compute these missing values. Replace the missing values by running average. You should use the “For” loop for this task.

In [24]:
data = [
    {"ID": "A001", "Project": "Project 1", "Cost": 1002000, "Status": "Finished"},
    {"ID": "A002", "Project": "Project 2", "Cost": 2000000, "Status": "Ongoing"},
    {"ID": "A003", "Project": "Project 3", "Cost": 4500000, "Status": "Finished"},
    {"ID": "A004", "Project": "Project 4", "Cost": 5500000, "Status": "Ongoing"},
    {"ID": "A005", "Project": "Project 5", "Cost": None,     "Status": "Finished"},
    {"ID": "A002", "Project": "Project 6", "Cost": 680000,  "Status": "Failed"},
    {"ID": "A005", "Project": "Project 7", "Cost": 400000,  "Status": "Finished"},
    {"ID": "A003", "Project": "Project 8", "Cost": 350000,  "Status": "Failed"},
    {"ID": "A001", "Project": "Project 9", "Cost": None,     "Status": "Ongoing"},
    {"ID": "A003", "Project": "Project 10", "Cost": 300000, "Status": "Finished"},
    {"ID": "A001", "Project": "Project 11", "Cost": 2000000, "Status": "Failed"},
    {"ID": "A004", "Project": "Project 12", "Cost": 1000000, "Status": "Ongoing"},
    {"ID": "A004", "Project": "Project 13", "Cost": 3000000, "Status": "Finished"},
    {"ID": "A005", "Project": "Project 14", "Cost": 200000,  "Status": "Finished"},
]

In [25]:
df = pd.DataFrame(data)

In [27]:
running_sum = 0
count = 0

for i in range(len(df)):
    if pd.isnull(df.loc[i, "Cost"]):
        # Avoid divide-by-zero if all previous are null (unlikely here)
        if count == 0:
            df.loc[i, "Cost"] = 0
        else:
            df.loc[i, "Cost"] = running_sum / count
    else:
        running_sum += df.loc[i, "Cost"]
        count += 1

In [28]:
print(df)

      ID     Project          Cost    Status
0   A001   Project 1  1.002000e+06  Finished
1   A002   Project 2  2.000000e+06   Ongoing
2   A003   Project 3  4.500000e+06  Finished
3   A004   Project 4  5.500000e+06   Ongoing
4   A005   Project 5  3.250500e+06  Finished
5   A002   Project 6  6.800000e+05    Failed
6   A005   Project 7  4.000000e+05  Finished
7   A003   Project 8  3.500000e+05    Failed
8   A001   Project 9  2.061714e+06   Ongoing
9   A003  Project 10  3.000000e+05  Finished
10  A001  Project 11  2.000000e+06    Failed
11  A004  Project 12  1.000000e+06   Ongoing
12  A004  Project 13  3.000000e+06  Finished
13  A005  Project 14  2.000000e+05  Finished

In [ ]:
Task 3 :-Split the name column in the Employee dataframe into two new columns “First Name”,
and “LastName” and remove the older “name” column.

In [29]:
df = pd.read_csv("three_data.csv")

In [30]:
df[['First Name', 'Last Name']] = df['Name'].str.split(' ', n=1, expand=True)

In [31]:
df.drop(columns=['Name'], inplace=True)

In [32]:
df.to_csv("employee_data_updated.csv", index=False)

In [33]:
print(df)

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [ ]:
Task 4 :- Join all three dataframes in one single dataframe. Name it “Final”

In [34]:
project_data = [
    {"ID": "A001", "Project": "Project 1", "Cost": 1002000, "Status": "Finished"},
    {"ID": "A002", "Project": "Project 2", "Cost": 2000000, "Status": "Ongoing"},
    {"ID": "A003", "Project": "Project 3", "Cost": 4500000, "Status": "Finished"},
    {"ID": "A004", "Project": "Project 4", "Cost": 5500000, "Status": "Ongoing"},
    {"ID": "A005", "Project": "Project 5", "Cost": None,     "Status": "Finished"},
    {"ID": "A002", "Project": "Project 6", "Cost": 680000,  "Status": "Failed"},
    {"ID": "A005", "Project": "Project 7", "Cost": 400000,  "Status": "Finished"},
    {"ID": "A003", "Project": "Project 8", "Cost": 350000,  "Status": "Failed"},
    {"ID": "A001", "Project": "Project 9", "Cost": None,     "Status": "Ongoing"},
    {"ID": "A003", "Project": "Project 10", "Cost": 300000, "Status": "Finished"},
    {"ID": "A001", "Project": "Project 11", "Cost": 2000000, "Status": "Failed"},
    {"ID": "A004", "Project": "Project 12", "Cost": 1000000, "Status": "Ongoing"},
    {"ID": "A004", "Project": "Project 13", "Cost": 3000000, "Status": "Finished"},
    {"ID": "A005", "Project": "Project 14", "Cost": 200000,  "Status": "Finished"},
]

In [35]:
project_df = pd.DataFrame(project_data)

In [36]:
employee_data = [
    {"ID": "A001", "Name": "John Alter", "Gender": "M", "City": "Paris", "Age": 25},
    {"ID": "A002", "Name": "Alice Luxumberg", "Gender": "F", "City": "London", "Age": 27},
    {"ID": "A003", "Name": "Tom Sabestine", "Gender": "M", "City": "Berlin", "Age": 29},
    {"ID": "A004", "Name": "Nina Adgra", "Gender": "F", "City": "Newyork", "Age": 31},
    {"ID": "A005", "Name": "Amy Johny", "Gender": "F", "City": "Madrid", "Age": 30},
]

In [37]:
employee_df = pd.DataFrame(employee_data)

In [38]:
seniority_data = [
    {"ID": "A001", "Designation Level": 2},
    {"ID": "A002", "Designation Level": 2},
    {"ID": "A003", "Designation Level": 3},
    {"ID": "A004", "Designation Level": 2},
    {"ID": "A005", "Designation Level": 3},
]

In [39]:
seniority_df = pd.DataFrame(seniority_data)

In [40]:
employee_seniority = pd.merge(employee_df, seniority_df, on="ID", how="left")

In [41]:
Final = pd.merge(project_df, employee_seniority, on="ID", how="left")

In [45]:
print(Final)

      ID     Project       Cost    Status             Name Gender     City  \
0   A001   Project 1  1002000.0  Finished       John Alter      M    Paris
1   A002   Project 2  2000000.0   Ongoing  Alice Luxumberg      F   London
2   A003   Project 3  4500000.0  Finished    Tom Sabestine      M   Berlin
3   A004   Project 4  5500000.0   Ongoing       Nina Adgra      F  Newyork
4   A005   Project 5        NaN  Finished        Amy Johny      F   Madrid
5   A002   Project 6   680000.0    Failed  Alice Luxumberg      F   London
6   A005   Project 7   400000.0  Finished        Amy Johny      F   Madrid
7   A003   Project 8   350000.0    Failed    Tom Sabestine      M   Berlin
8   A001   Project 9        NaN   Ongoing       John Alter      M    Paris
9   A003  Project 10   300000.0  Finished    Tom Sabestine      M   Berlin
10  A001  Project 11  2000000.0    Failed       John Alter      M    Paris
11  A004  Project 12  1000000.0   Ongoing       Nina Adgra      F  Newyork
12  A004  Project 13  3000000.0  Finished       Nina Adgra      F  Newyork
13  A005  Project 14   200000.0  Finished        Amy Johny      F   Madrid

    Age  Designation Level
0    25                  2
1    27                  2
2    29                  3
3    31                  2
4    30                  3
5    27                  2
6    30                  3
7    29                  3
8    25                  2
9    29                  3
10   25                  2
11   31                  2
12   31                  2
13   30                  3

In [ ]:
Task 5:- Add a new bonus column in the Final dataframe. Give a 5% bonus concerning project cost only to employees who have finished the projects.

In [46]:
Final['Bonus'] = 0

In [47]:
for i in range(len(Final)):
    if Final.loc[i, 'Status'] == 'Finished' and pd.notnull(Final.loc[i, 'Cost']):
        Final.loc[i, 'Bonus'] = Final.loc[i, 'Cost'] * 0.05

In [48]:
print(Final)

      ID     Project       Cost    Status             Name Gender     City  \
0   A001   Project 1  1002000.0  Finished       John Alter      M    Paris
1   A002   Project 2  2000000.0   Ongoing  Alice Luxumberg      F   London
2   A003   Project 3  4500000.0  Finished    Tom Sabestine      M   Berlin
3   A004   Project 4  5500000.0   Ongoing       Nina Adgra      F  Newyork
4   A005   Project 5        NaN  Finished        Amy Johny      F   Madrid
5   A002   Project 6   680000.0    Failed  Alice Luxumberg      F   London
6   A005   Project 7   400000.0  Finished        Amy Johny      F   Madrid
7   A003   Project 8   350000.0    Failed    Tom Sabestine      M   Berlin
8   A001   Project 9        NaN   Ongoing       John Alter      M    Paris
9   A003  Project 10   300000.0  Finished    Tom Sabestine      M   Berlin
10  A001  Project 11  2000000.0    Failed       John Alter      M    Paris
11  A004  Project 12  1000000.0   Ongoing       Nina Adgra      F  Newyork
12  A004  Project 13  3000000.0  Finished       Nina Adgra      F  Newyork
13  A005  Project 14   200000.0  Finished        Amy Johny      F   Madrid

    Age  Designation Level   Bonus
0    25                  2   50100
1    27                  2       0
2    29                  3  225000
3    31                  2       0
4    30                  3       0
5    27                  2       0
6    30                  3   20000
7    29                  3       0
8    25                  2       0
9    29                  3   15000
10   25                  2       0
11   31                  2       0
12   31                  2  150000
13   30                  3   10000

In [ ]:
Task 6:-Demote  the designation  level  by 1,  whose  projects  have  status  “fail”.  Delete  the employees record whose designation level is above 4.

In [50]:
failed_ids = Final[Final['Status'].str.lower() == 'failed']['ID'].unique()

In [51]:
for i in range(len(Final)):
    if Final.loc[i, 'ID'] in failed_ids:
        Final.loc[i, 'Designation Level'] -= 1

In [52]:
Final = Final[Final['Designation Level'] <= 4]

In [53]:
Final.reset_index(drop=True, inplace=True)

In [62]:
print(Final)

      ID     Project       Cost    Status             Name     City  Age  \
0   A001   Project 1  1002000.0  Finished       John Alter    Paris   25
1   A002   Project 2  2000000.0   Ongoing  Alice Luxumberg   London   27
2   A003   Project 3  4500000.0  Finished    Tom Sabestine   Berlin   29
3   A004   Project 4  5500000.0   Ongoing       Nina Adgra  Newyork   31
4   A005   Project 5        NaN  Finished        Amy Johny   Madrid   30
5   A002   Project 6   680000.0    Failed  Alice Luxumberg   London   27
6   A005   Project 7   400000.0  Finished        Amy Johny   Madrid   30
7   A003   Project 8   350000.0    Failed    Tom Sabestine   Berlin   29
8   A001   Project 9        NaN   Ongoing       John Alter    Paris   25
9   A003  Project 10   300000.0  Finished    Tom Sabestine   Berlin   29
10  A001  Project 11  2000000.0    Failed       John Alter    Paris   25
11  A004  Project 12  1000000.0   Ongoing       Nina Adgra  Newyork   31
12  A004  Project 13  3000000.0  Finished       Nina Adgra  Newyork   31
13  A005  Project 14   200000.0  Finished        Amy Johny   Madrid   30

    Designation Level   Bonus
0                   1   50100
1                   1       0
2                   2  225000
3                   2       0
4                   3       0
5                   1       0
6                   3   20000
7                   2       0
8                   1       0
9                   2   15000
10                  1       0
11                  2       0
12                  2  150000
13                  3   10000

In [63]:
data = {
    "ID": ["A001", "A002", "A003", "A004", "A005", "A002", "A005", "A003", "A001", "A003", "A001", "A004", "A004", "A005"],
    "Project": ["Project 1", "Project 2", "Project 3", "Project 4", "Project 5", "Project 6", "Project 7", "Project 8", "Project 9", "Project 10", "Project 11", "Project 12", "Project 13", "Project 14"],
    "Cost": [1002000, 2000000, 4500000, 5500000, None, 680000, 400000, 350000, None, 300000, 2000000, 1000000, 3000000, 200000],
    "Status": ["Finished", "Ongoing", "Finished", "Ongoing", "Finished", "Failed", "Finished", "Failed", "Ongoing", "Finished", "Failed", "Ongoing", "Finished", "Finished"],
    "Name": ["John Alter", "Alice Luxumberg", "Tom Sabestine", "Nina Adgra", "Amy Johny", "Alice Luxumberg", "Amy Johny", "Tom Sabestine", "John Alter", "Tom Sabestine", "John Alter", "Nina Adgra", "Nina Adgra", "Amy Johny"],
    "City": ["Paris", "London", "Berlin", "Newyork", "Madrid", "London", "Madrid", "Berlin", "Paris", "Berlin", "Paris", "Newyork", "Newyork", "Madrid"],
    "Age": [25, 27, 29, 31, 30, 27, 30, 29, 25, 29, 25, 31, 31, 30],
    "Designation Level": [2, 2, 3, 2, 3, 2, 3, 3, 2, 3, 2, 2, 2, 3]
}

In [64]:
df = pd.DataFrame(data)

In [65]:
gender_list = ['M', 'F', 'M', 'F', 'F', 'F', 'F', 'M', 'M', 'M', 'M', 'F', 'F', 'F']

In [66]:
df['Gender'] = gender_list

In [67]:
print(df)

      ID     Project       Cost    Status             Name     City  Age  \
0   A001   Project 1  1002000.0  Finished       John Alter    Paris   25
1   A002   Project 2  2000000.0   Ongoing  Alice Luxumberg   London   27
2   A003   Project 3  4500000.0  Finished    Tom Sabestine   Berlin   29
3   A004   Project 4  5500000.0   Ongoing       Nina Adgra  Newyork   31
4   A005   Project 5        NaN  Finished        Amy Johny   Madrid   30
5   A002   Project 6   680000.0    Failed  Alice Luxumberg   London   27
6   A005   Project 7   400000.0  Finished        Amy Johny   Madrid   30
7   A003   Project 8   350000.0    Failed    Tom Sabestine   Berlin   29
8   A001   Project 9        NaN   Ongoing       John Alter    Paris   25
9   A003  Project 10   300000.0  Finished    Tom Sabestine   Berlin   29
10  A001  Project 11  2000000.0    Failed       John Alter    Paris   25
11  A004  Project 12  1000000.0   Ongoing       Nina Adgra  Newyork   31
12  A004  Project 13  3000000.0  Finished       Nina Adgra  Newyork   31
13  A005  Project 14   200000.0  Finished        Amy Johny   Madrid   30

    Designation Level Gender
0                   2      M
1                   2      F
2                   3      M
3                   2      F
4                   3      F
5                   2      F
6                   3      F
7                   3      M
8                   2      M
9                   3      M
10                  2      M
11                  2      F
12                  2      F
13                  3      F

In [ ]:
Task 7:- Add “Mr.” and “Mrs.” to the first name column and drop the gender column.

In [68]:
df[['First Name', 'Last Name']] = df['Name'].str.split(' ', n=1, expand=True)

In [69]:
df['First Name'] = df.apply(
    lambda row: f"Mr. {row['First Name']}" if row['Gender'] == 'M' else f"Mrs. {row['First Name']}",
    axis=1
)

In [70]:
print(df[['ID', 'First Name', 'Last Name', 'Gender', 'Project', 'Cost', 'Status', 'City', 'Age', 'Designation Level']])

      ID  First Name  Last Name Gender     Project       Cost    Status  \
0   A001    Mr. John      Alter      M   Project 1  1002000.0  Finished
1   A002  Mrs. Alice  Luxumberg      F   Project 2  2000000.0   Ongoing
2   A003     Mr. Tom  Sabestine      M   Project 3  4500000.0  Finished
3   A004   Mrs. Nina      Adgra      F   Project 4  5500000.0   Ongoing
4   A005    Mrs. Amy      Johny      F   Project 5        NaN  Finished
5   A002  Mrs. Alice  Luxumberg      F   Project 6   680000.0    Failed
6   A005    Mrs. Amy      Johny      F   Project 7   400000.0  Finished
7   A003     Mr. Tom  Sabestine      M   Project 8   350000.0    Failed
8   A001    Mr. John      Alter      M   Project 9        NaN   Ongoing
9   A003     Mr. Tom  Sabestine      M  Project 10   300000.0  Finished
10  A001    Mr. John      Alter      M  Project 11  2000000.0    Failed
11  A004   Mrs. Nina      Adgra      F  Project 12  1000000.0   Ongoing
12  A004   Mrs. Nina      Adgra      F  Project 13  3000000.0  Finished
13  A005    Mrs. Amy      Johny      F  Project 14   200000.0  Finished

       City  Age  Designation Level
0     Paris   25                  2
1    London   27                  2
2    Berlin   29                  3
3   Newyork   31                  2
4    Madrid   30                  3
5    London   27                  2
6    Madrid   30                  3
7    Berlin   29                  3
8     Paris   25                  2
9    Berlin   29                  3
10    Paris   25                  2
11  Newyork   31                  2
12  Newyork   31                  2
13   Madrid   30                  3

In [71]:
df.drop(columns=['Gender'], inplace=True)

In [77]:
print(df)

      ID     Project       Cost    Status             Name     City  Age  \
0   A001   Project 1  1002000.0  Finished       John Alter    Paris   25
1   A002   Project 2  2000000.0   Ongoing  Alice Luxumberg   London   27
2   A003   Project 3  4500000.0  Finished    Tom Sabestine   Berlin   29
3   A004   Project 4  5500000.0   Ongoing       Nina Adgra  Newyork   31
4   A005   Project 5        NaN  Finished        Amy Johny   Madrid   30
5   A002   Project 6   680000.0    Failed  Alice Luxumberg   London   27
6   A005   Project 7   400000.0  Finished        Amy Johny   Madrid   30
7   A003   Project 8   350000.0    Failed    Tom Sabestine   Berlin   29
8   A001   Project 9        NaN   Ongoing       John Alter    Paris   25
9   A003  Project 10   300000.0  Finished    Tom Sabestine   Berlin   29
10  A001  Project 11  2000000.0    Failed       John Alter    Paris   25
11  A004  Project 12  1000000.0   Ongoing       Nina Adgra  Newyork   31
12  A004  Project 13  3000000.0  Finished       Nina Adgra  Newyork   31
13  A005  Project 14   200000.0  Finished        Amy Johny   Madrid   30

    Designation Level  First Name  Last Name
0                   2    Mr. John      Alter
1                   2  Mrs. Alice  Luxumberg
2                   3     Mr. Tom  Sabestine
3                   4   Mrs. Nina      Adgra
4                   5    Mrs. Amy      Johny
5                   2  Mrs. Alice  Luxumberg
6                   5    Mrs. Amy      Johny
7                   3     Mr. Tom  Sabestine
8                   2    Mr. John      Alter
9                   3     Mr. Tom  Sabestine
10                  2    Mr. John      Alter
11                  4   Mrs. Nina      Adgra
12                  4   Mrs. Nina      Adgra
13                  5    Mrs. Amy      Johny

In [ ]:
Task 8:-Promote designation level by 1 for the employees whose age is more than 29 years using IF condition.

In [78]:
for i in range(len(df)):
    if df.loc[i, 'Age'] > 29:
        df.loc[i, 'Designation Level'] = df.loc[i, 'Designation Level'] + 1

In [79]:
print(df)

      ID     Project       Cost    Status             Name     City  Age  \
0   A001   Project 1  1002000.0  Finished       John Alter    Paris   25
1   A002   Project 2  2000000.0   Ongoing  Alice Luxumberg   London   27
2   A003   Project 3  4500000.0  Finished    Tom Sabestine   Berlin   29
3   A004   Project 4  5500000.0   Ongoing       Nina Adgra  Newyork   31
4   A005   Project 5        NaN  Finished        Amy Johny   Madrid   30
5   A002   Project 6   680000.0    Failed  Alice Luxumberg   London   27
6   A005   Project 7   400000.0  Finished        Amy Johny   Madrid   30
7   A003   Project 8   350000.0    Failed    Tom Sabestine   Berlin   29
8   A001   Project 9        NaN   Ongoing       John Alter    Paris   25
9   A003  Project 10   300000.0  Finished    Tom Sabestine   Berlin   29
10  A001  Project 11  2000000.0    Failed       John Alter    Paris   25
11  A004  Project 12  1000000.0   Ongoing       Nina Adgra  Newyork   31
12  A004  Project 13  3000000.0  Finished       Nina Adgra  Newyork   31
13  A005  Project 14   200000.0  Finished        Amy Johny   Madrid   30

    Designation Level  First Name  Last Name
0                   2    Mr. John      Alter
1                   2  Mrs. Alice  Luxumberg
2                   3     Mr. Tom  Sabestine
3                   5   Mrs. Nina      Adgra
4                   6    Mrs. Amy      Johny
5                   2  Mrs. Alice  Luxumberg
6                   6    Mrs. Amy      Johny
7                   3     Mr. Tom  Sabestine
8                   2    Mr. John      Alter
9                   3     Mr. Tom  Sabestine
10                  2    Mr. John      Alter
11                  5   Mrs. Nina      Adgra
12                  5   Mrs. Nina      Adgra
13                  6    Mrs. Amy      Johny

In [ ]:
Task 9:- Add  the  cost  of  all  projects  for  each  Employee  and  save  it  in  new  dataframe

In [84]:
df[['First Name', 'Last Name']] = df['Name'].str.split(' ', n=1, expand=True)

In [85]:
df['Cost'] = pd.to_numeric(df['Cost'], errors='coerce')

In [86]:
TotalProjCost = df.groupby(['ID', 'First Name'])['Cost'].sum().reset_index()

In [87]:
TotalProjCost.rename(columns={'Cost': 'Total Cost'}, inplace=True)

In [88]:
print(TotalProjCost)

     ID First Name  Total Cost
0  A001       John   3002000.0
1  A002      Alice   2680000.0
2  A003        Tom   5150000.0
3  A004       Nina   9500000.0
4  A005        Amy    600000.0

In [ ]:
Task 10:-Print all the employee details whose city name contains the letter “o” in it."

In [89]:
employees_with_o = df[df['City'].str.contains('o', case=False, na=False)]

In [90]:
print(employees_with_o)

      ID     Project       Cost    Status             Name     City  Age  \
1   A002   Project 2  2000000.0   Ongoing  Alice Luxumberg   London   27
3   A004   Project 4  5500000.0   Ongoing       Nina Adgra  Newyork   31
5   A002   Project 6   680000.0    Failed  Alice Luxumberg   London   27
11  A004  Project 12  1000000.0   Ongoing       Nina Adgra  Newyork   31
12  A004  Project 13  3000000.0  Finished       Nina Adgra  Newyork   31

    Designation Level First Name  Last Name
1                   2      Alice  Luxumberg
3                   5       Nina      Adgra
5                   2      Alice  Luxumberg
11                  5       Nina      Adgra
12                  5       Nina      Adgra